imProcessCreate
| where (TargetProcessName endswith "\\Bitsadmin.exe" or TargetProcessName endswith "\\Certutil.exe" or TargetProcessName endswith "\\Mshta.exe" or TargetProcessName endswith "\\Regsvr32.exe" or TargetProcessName endswith "\\Rundll32.exe" or TargetProcessName endswith "\\Msiexec.exe" or TargetProcessName endswith "\\Installutil.exe" or TargetProcessName endswith "\\curl.exe") and TargetProcessCommandLine matches regex "(?i)\\b(?:https?|ftp)://(?:(?:25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)\\.){3}(?:25[0-5]|2[0-4]\\d|1\\d\\d|[1-9]?\\d)" and ((ParentProcessName endswith "\\mshta.exe" or ParentProcessName endswith "\\wscript.exe" or ParentProcessName endswith "\\cscript.exe") or (ActingProcessName endswith "\\mshta.exe" or ActingProcessName endswith "\\wscript.exe" or ActingProcessName endswith "\\cscript.exe"))
